Repository: HasanFidan/PhotoUploader
Catalog: Properties/Resources.*.resx
Languages: nl

# main_footer_version
source: Version
nl: Versie

# main_hdr_connected
source: Connected
nl: Connectie met

# main_hdr_disconnected
source: Disconnected
nl: Geen connectie

# main_img_deleting
source: Deleting Images
nl: Deleten foto's

# main_img_Fetching
source: Fetching Images
nl: Ophalen foto's

# main_img_uploading
source: Uploading Images
nl: Uploaden foto's

# main_msg_AllUploadSuccess
source: All images are uploaded succesfully.
nl: Alle foto's zijn succesvol geupload

# main_msg_ConnectionEstablished
source: Internet connection is established
nl: Connectie met internet is vastgesteld

# main_msg_connectionlost
source: Internet connection is lost.
nl: Internet verbinding verbroken

# main_msg_imagenoexist
source: Image(s) in C:\\PhotoImages folder does not exist in the camera of the connected Photo, therefore cannot be deleted.
nl: Map C:\\ScoutboxImages bestaat niet, foto's kunnen niet worden verwijdered

# main_msg_noImage
source: There are no images in the camera storage.
nl: Er zijn geen foto's gevonden op de camera

# main_msg_plugandunplug
source: Please unplug and plug the camera to start the process.
nl: Sluit de Scoutbox aan met de USB kabel om het uploaden te starten

# main_text_help
source: The first thing that needs paying attention is the status, Disconnected and Connected. By following the changes between these two statuses, you can understand the current situation of the process. There are 3 steps in the application: - Fetching the images from camera - Uploading the fetched ones to FTP server - Deleting the images from the camera Note that, if there is another device connected to your computer, Photo Uploader Application may have trouble on working. Please make sure that Photo is the only device connected to your computer while working. Camera needs to be plugged in for application to fetch the images. Until that moment, the icon for fetching process will remain as “waiting”. If camera is switched off or plugged out, fetching functionality will not be working until camera is plugged in again. For this case, “waiting” icon will be displayed. After all the images are fetched, related icon will turn to “tick” and process will be successful. After fetching is done, application starts uploading process. Until that moment, “waiting” icon is placed for uploading process. In this section, it is important have a valid internet connection. It is not important for uploading process if camera is plugged in as long as there are already fetched images in the folder. You will be notified by turning the icon to successful tick when all the images are uploaded to FTP server. Yet, camera must be plugged in for deleting process. After all images are deleted, you will be notified like the other processes, turning the icon to a successful tick. Until the deleting process is active, you will see a “waiting” icon for the process. If there’s an image that can not be deleted for any reason, application will show a message accordingly. If another Photo is connected, then the application will stop processing. It is needed to restart the application in order to proceed. When any of the processes are active/running, the number of processed elements and total count will be displayed within a “busy” icon. When all the processes are done successfully, you will be notified with a message like “All images are uploaded successfully.”
nl: Het eerste waarop gelet moet worden is de status ‘Connectie met’ en ‘Geen connectie’. Door de verandering van de status in de gaten te houden, kan de huidige situatie van het proces begrepen worden. Er zijn 3 stappen in deze applicatie: - Het ophalen van de foto’s van de camera - Het uploaden van de foto’s naar de FTP server - Het verwijderen van de foto’s van de camera Als er een ander apparaat verbonden is met de computer, kan de Scoutbox uploader applicatie mogelijk niet werken. Zorg ervoor dat de Scoutbox het enige apparaat is dat met de computer verbonden is tijdens het uploaden van foto’s. De camera moet ingeplugd zijn voor de applicatie om foto’s op te halen. Totdat dit gebeurd, zal het icoon van ‘Ophalen foto’s’ “Wachten” weergeven. Als de camera uit staat of niet ingeplugd is, zal de ophalen functionaliteit niet werken, totdat de camera weer is aangesloten. Dan zal het “Wachten” icoon worden weergegeven. Nadat alle foto’s zijn opgehaald, zal het gerelateerde icoon veranderen in een “Vink” en het proces is succesvol afgerond. Nadat het ophalen is afgerond, zal de applicatie het upload proces starten. Totdat dit gebeurd, zal het “Wachten” icoon zichtbaar zijn. Tijdens dit proces is het belangrijk dat er een goede internet connectie is. Het is niet nodig om tijdens dit proces de camera aangesloten te hebben op de computer, de foto’s staan al in de juiste map op de computer. Als het icoon veranderd in een “Vink” betekend dit dat het uploaden van de foto’s naar de FTP server succesvol is afgerond.Voor het verwijderen van de foto’s moet de camera wel weer aangesloten zijn aan de computer. Nadat alle foto’s zijn verwijderd, zal net als bij de voorgaande processen, het icoon veranderen in een “Vink”. Totdat het verwijder proces wordt aangeroepen, is het icoon “Wachten” zichtbaar. Als er een foto is die voor wat voor reden niet verwijderd kan worden, zal er een bericht weergegeven worden. Als er een andere Scoutbox aangesloten is, zal de applicatie stoppen met werken. De applicatie moet worden herstart om verder te kunnen gaan.Wanneer elk van de processen actief is, zal het aantal van verwerkte elementen en het totaal aantal elementen weergegeven worden in het “Bezig” icoon. Wanneer alle processen succesvol zijn afgerond, zal er een bericht komen. “Alle foto’s zijn succesvol geupload.”

# main_lbl_help
source: Help
nl: Hulp
